# # Working With Missing Data
[From the dataquest.io site](https://www.dataquest.io/m/83/data-manipulation-with-pandas/5/normalizing-columns-in-a-data-set)
### <p style="color:Tomato">Learn to handle missing data using pandas, and a data set on Titanic survival.
<p/>
#### <p style="color:Gray">Clean and analyze data on passenger survival from the Titanic. Many of the columns, such as age and sex, have missing data.<p/>
* cause errors
* finding the mean of a column with a missing value is not successful.
because it's impossible to average  missing value.


<p style="color:Blue">**1. titanic_survival.csv**<p/>

In [1]:
import pandas as pd
import numpy as np

In [2]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

In [3]:
titanic_survival = pd.read_csv("titanic_survival.csv")

In [4]:
age = titanic_survival["age"]
print(age.loc[10:20])

10    47.0
11    18.0
12    24.0
13    26.0
14    80.0
15     NaN
16    24.0
17    50.0
18    32.0
19    36.0
20    37.0
Name: age, dtype: float64

In [5]:
age_is_null = pd.isnull(age)
age_null_true = age[age_is_null]
age_null_count = len(age_null_true)
print(age_null_count)

264

#### <p style="color:Gray">NaN<p/>
not a number, to indicate a missing value
#### <p style="color:Gray">pandas.isnull()<p/>
returns a series of True and False values.

In [6]:
sex = titanic_survival["sex"]
sex_is_null = pd.isnull(sex)
print(sex_is_null)

0       False
1       False
2       False
3       False
4       False
5       False
6       False
7       False
8       False
9       False
10      False
11      False
12      False
13      False
14      False
15      False
16      False
17      False
18      False
19      False
20      False
21      False
22      False
23      False
24      False
25      False
26      False
27      False
28      False
29      False
        ...
1280    False
1281    False
1282    False
1283    False
1284    False
1285    False
1286    False
1287    False
1288    False
1289    False
1290    False
1291    False
1292    False
1293    False
1294    False
1295    False
1296    False
1297    False
1298    False
1299    False
1300    False
1301    False
1302    False
1303    False
1304    False
1305    False
1306    False
1307    False
1308    False
1309     True
Name: sex, Length: 1310, dtype: bool

In [7]:
sex_null_true = sex[sex_is_null]
print(sex_null_true)

1309    NaN
Name: sex, dtype: object

This is because any calculations we do with a null value also result in a null value.

In [8]:
age_is_null = pd.isnull(titanic_survival["age"])
good_ages = titanic_survival["age"][age_is_null == False]
correct_mean_age = sum(good_ages) / len(good_ages)
print(correct_mean_age)

29.8811345124

#### <p style="color:Gray">Series.mean()<p/>
To calculate the mean of a column,<br/>
missing values will not be includd in the calculation.

In [9]:
correct_mean_age = titanic_survival["age"].mean()
print(correct_mean_age)

29.8811345124283

Assign the mean of the "fare" column to correct_mean_fare.

In [10]:
correct_mean_fare = titanic_survival["fare"].mean()
print(correct_mean_fare)

33.29547928134572

In [11]:
passenger_classes = [1,2,3]
fares_by_class = {}

In [12]:
for this_class in passenger_classes:
#     print(this_class)
    pclass_rows = titanic_survival[titanic_survival["pclass"] == this_class] 
#     print(pclass_rows)
    pclass_fares = pclass_rows["fare"]
#     print(pclass_fares)
    fare_for_class = pclass_fares.mean()
    print(pclass_fares.mean())
#     print(fare_for_class)
    fares_by_class[this_class] = fare_for_class

87.50899164086687
21.1791963898917
13.302888700564957

In [13]:
print(fares_by_class[1])
print(fares_by_class[2])
print(fares_by_class[3])

87.50899164086687
21.1791963898917
13.302888700564957

#### <p style="color:Tomato"> Pivot tables<p/>
하나의 열로 하위 집합을 만든 다음 합계 또는 평균과 같은 계산을 적용할 수 있다. 
<br>
> 피벗 테이블을 먼저 그룹화 한 다음 계산을 적용한다. 위에서는 pclass열을 기준으로 그룹화 한 다음 각 클래스의 fare열의 평균을 계산하여 수동으로 피벗 테이블을 만들었다.

In [14]:
passenger_class_fares = titanic_survival.pivot_table(
    index="pclass", values="fare", aggfunc=np.mean)
print(passenger_class_fares)

             fare
pclass
1.0     87.508992
2.0     21.179196
3.0     13.302889

#### <p style="color:Gray">First parameter<p/>
> index tells the method which column to group by.
> Index는 메서드를 통해 그룹화 할 열을 알려준다.

#### <p style="color:Gray">Second parameter<p/>
> values is the column that we want to apply the calculation to,and aggfunc specifies the calculation we want to perform.
> 두 번째 매개 변수 값은 계산을 적용하려는 열이다. 

#### <p style="color:Gray">Third parameter<p/>
> aggfunc specifies the calculation we want to perform. The defalt for the aggfunc parameter is actually the mean.
> aggfunc는 수행하고자 하는 계산방법을 지정한다.

In [15]:
passenger_survival = titanic_survival.pivot_table(
    index="pclass", values="survived")
print(passenger_survival)

        survived
pclass
1.0     0.619195
2.0     0.429603
3.0     0.255289

[http://pbpython.com/pandas-pivot-table-explained.html](http://pbpython.com/pandas-pivot-table-explained.html)

In [16]:
passenger_age = titanic_survival.pivot_table(index="pclass", values="age")
print(passenger_age)

              age
pclass
1.0     39.159918
2.0     29.506705
3.0     24.816367

A pivot table that calculates the total fares collected ("fare") and total number of survivors ("survived") for each embarkation port ("embarked") <br>
<br>
각 승선 포트에 대한 수집된 운임과 총 생존자 수

In [17]:
port_stats = titanic_survival.pivot_table(
    index="embarked", values=["fare", "survived"], 
    aggfunc=np.sum)
print(port_stats)

                fare  survived
embarked
C         16830.7922     150.0
Q          1526.3085      44.0
S         25033.3862     304.0

### Remove the missing values in a vector of data, and in a matrix

 #### <p style="color:Tomato"> What is matrix?<p/>
 #### <p style="color:Tomato"> What is vector?<p/>

#### <p style="color:Gray">DataFrame.dropna()<p/>
This method will drop any rows that contain missing values.

참고사이트: [결측값 있는 행 제거](http://rfriend.tistory.com/263)

```python
df.dropna(axis=0)
```
* Delete row with NaN <br>
* 결측값이 들어있는 행 전체를 삭제한다. <br>
* 모든 column은 유지되고, nan값이 들어있는 행만 삭제된다. 

```python
df.dropna(axis=1)
```
* Delete column with NaN <br>
* 결측값이 들어있는 열 전체를 삭제한다. <br>
* NaN값을 포함하고 있는 칼럼이 지워진다.

In [18]:
drop_na_rows = titanic_survival.dropna(axis=0)
drop_na_col = titanic_survival.dropna(axis=1)
print(drop_na_rows)
print(drop_na_col)

Empty DataFrame
Columns: [pclass, survived, name, sex, age, sibsp, parch, ticket, fare, cabin, embarked, boat, body, home.dest]
Index: []
Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, ...]

[1310 rows x 0 columns]

```python
dat.dropna(how='any') #to drop if any value in the row has a nan
dat.dropna(how='all') #to drop if all values in the row are nan
```

In [19]:
len(titanic_survival.index)

1310

In [20]:
drop_na_columns = titanic_survival.dropna(
    axis=1)
print(drop_na_columns)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, ...]

[1310 rows x 0 columns]

where the columns "age", "sex" have missing values and assign he result t new_titanic_survival.

In [21]:
new_titanic_survival = titanic_survival.dropna(axis=0, subset=["age", "sex"])
print(new_titanic_survival)

      pclass  survived                                               name  \
0        1.0       1.0                      Allen, Miss. Elisabeth Walton
1        1.0       1.0                     Allison, Master. Hudson Trevor
2        1.0       0.0                       Allison, Miss. Helen Loraine
3        1.0       0.0               Allison, Mr. Hudson Joshua Creighton
4        1.0       0.0    Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
5        1.0       1.0                                Anderson, Mr. Harry
6        1.0       1.0                  Andrews, Miss. Kornelia Theodosia
7        1.0       0.0                             Andrews, Mr. Thomas Jr
8        1.0       1.0      Appleton, Mrs. Edward Dale (Charlotte Lamson)
9        1.0       0.0                            Artagaveytia, Mr. Ramon
10       1.0       0.0                             Astor, Col. John Jacob
11       1.0       1.0  Astor, Mrs. John Jacob (Madeleine Talmadge Force)
12       1.0       1.0                      Aubart, Mme. Leontine Pauline
13       1.0       1.0                       Barber, Miss. Ellen "Nellie"
14       1.0       1.0               Barkworth, Mr. Algernon Henry Wilson
16       1.0       0.0                           Baxter, Mr. Quigg Edmond
17       1.0       1.0    Baxter, Mrs. James (Helene DeLaudeniere Chaput)
18       1.0       1.0                              Bazzani, Miss. Albina
19       1.0       0.0                               Beattie, Mr. Thomson
20       1.0       1.0                      Beckwith, Mr. Richard Leonard
21       1.0       1.0   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)
22       1.0       1.0                              Behr, Mr. Karl Howell
23       1.0       1.0                              Bidois, Miss. Rosalie
24       1.0       1.0                                  Bird, Miss. Ellen
25       1.0       0.0                                Birnbaum, Mr. Jakob
26       1.0       1.0                            Bishop, Mr. Dickinson H
27       1.0       1.0            Bishop, Mrs. Dickinson H (Helen Walton)
28       1.0       1.0                             Bissette, Miss. Amelia
29       1.0       1.0          Bjornstrom-Steffansson, Mr. Mauritz Hakan
30       1.0       0.0                       Blackwell, Mr. Stephen Weart
...      ...       ...                                                ...
1269     3.0       0.0                   Vande Velde, Mr. Johannes Joseph
1270     3.0       0.0                     Vande Walle, Mr. Nestor Cyriel
1271     3.0       0.0                        Vanden Steen, Mr. Leo Peter
1272     3.0       0.0                        Vander Cruyssen, Mr. Victor
1273     3.0       0.0                 Vander Planke, Miss. Augusta Maria
1274     3.0       0.0                          Vander Planke, Mr. Julius
1275     3.0       0.0                    Vander Planke, Mr. Leo Edmondus
1276     3.0       0.0  Vander Planke, Mrs. Julius (Emelia Maria Vande...
1277     3.0       1.0                               Vartanian, Mr. David
1278     3.0       0.0                             Vendel, Mr. Olof Edvin
1279     3.0       0.0               Vestrom, Miss. Hulda Amanda Adolfina
1280     3.0       0.0                                    Vovk, Mr. Janko
1281     3.0       0.0                               Waelens, Mr. Achille
1285     3.0       0.0                                Wenzel, Mr. Linhart
1286     3.0       1.0    Whabee, Mrs. George Joseph (Shawneene Abi-Saab)
1287     3.0       0.0                   Widegren, Mr. Carl/Charles Peter
1288     3.0       0.0                          Wiklund, Mr. Jakob Alfred
1289     3.0       0.0                            Wiklund, Mr. Karl Johan
1290     3.0       1.0                   Wilkes, Mrs. James (Ellen Needs)
1294     3.0       0.0                               Williams, Mr. Leslie
1295     3.0       0.0                                Windelov, Mr. Einar
1296     3.0       0.0                                   Wirz, Mr. Albert
1298     3.0       0.0                          Wittevrongel, Mr. Camille
1299     3.0       0.0                                Yasbeck, Mr. Antoni
1300     3.0       1.0            Yasbeck, Mrs. Antoni (Selini Alexander)
1301     3.0       0.0                               Youseff, Mr. Gerious
1304     3.0       0.0                               Zabour, Miss. Hileni
1306     3.0       0.0                          Zakarian, Mr. Mapriededer
1307     3.0       0.0                                Zakarian, Mr. Ortin
1308     3.0       0.0                                 Zimmerman, Mr. Leo

         sex      age  sibsp  parch            ticket      fare    cabin  \
0     female  29.0000    0.0    0.0             24160  211.3375       B5
1       male   0.9167    1.0    2.0            113781  151.5500  C22 C26
2     female   2.0000    1.0    2.0            113781  151.5500  C22 C26
3       male  30.0000    1.0    2.0            113781  151.5500  C22 C26
4     female  25.0000    1.0    2.0            113781  151.5500  C22 C26
5       male  48.0000    0.0    0.0             19952   26.5500      E12
6     female  63.0000    1.0    0.0             13502   77.9583       D7
7       male  39.0000    0.0    0.0            112050    0.0000      A36
8     female  53.0000    2.0    0.0             11769   51.4792     C101
9       male  71.0000    0.0    0.0          PC 17609   49.5042      NaN
10      male  47.0000    1.0    0.0          PC 17757  227.5250  C62 C64
11    female  18.0000    1.0    0.0          PC 17757  227.5250  C62 C64
12    female  24.0000    0.0    0.0          PC 17477   69.3000      B35
13    female  26.0000    0.0    0.0             19877   78.8500      NaN
14      male  80.0000    0.0    0.0             27042   30.0000      A23
16      male  24.0000    0.0    1.0          PC 17558  247.5208  B58 B60
17    female  50.0000    0.0    1.0          PC 17558  247.5208  B58 B60
18    female  32.0000    0.0    0.0             11813   76.2917      D15
19      male  36.0000    0.0    0.0             13050   75.2417       C6
20      male  37.0000    1.0    1.0             11751   52.5542      D35
21    female  47.0000    1.0    1.0             11751   52.5542      D35
22      male  26.0000    0.0    0.0            111369   30.0000     C148
23    female  42.0000    0.0    0.0          PC 17757  227.5250      NaN
24    female  29.0000    0.0    0.0          PC 17483  221.7792      C97
25      male  25.0000    0.0    0.0             13905   26.0000      NaN
26      male  25.0000    1.0    0.0             11967   91.0792      B49
27    female  19.0000    1.0    0.0             11967   91.0792      B49
28    female  35.0000    0.0    0.0          PC 17760  135.6333      C99
29      male  28.0000    0.0    0.0            110564   26.5500      C52
30      male  45.0000    0.0    0.0            113784   35.5000        T
...      ...      ...    ...    ...               ...       ...      ...
1269    male  33.0000    0.0    0.0            345780    9.5000      NaN
1270    male  28.0000    0.0    0.0            345770    9.5000      NaN
1271    male  28.0000    0.0    0.0            345783    9.5000      NaN
1272    male  47.0000    0.0    0.0            345765    9.0000      NaN
1273  female  18.0000    2.0    0.0            345764   18.0000      NaN
1274    male  31.0000    3.0    0.0            345763   18.0000      NaN
1275    male  16.0000    2.0    0.0            345764   18.0000      NaN
1276  female  31.0000    1.0    0.0            345763   18.0000      NaN
1277    male  22.0000    0.0    0.0              2658    7.2250      NaN
1278    male  20.0000    0.0    0.0            350416    7.8542      NaN
1279  female  14.0000    0.0    0.0            350406    7.8542      NaN
1280    male  22.0000    0.0    0.0            349252    7.8958      NaN
1281    male  22.0000    0.0    0.0            345767    9.0000      NaN
1285    male  32.5000    0.0    0.0            345775    9.5000      NaN
1286  female  38.0000    0.0    0.0              2688    7.2292      NaN
1287    male  51.0000    0.0    0.0            347064    7.7500      NaN
1288    male  18.0000    1.0    0.0           3101267    6.4958      NaN
1289    male  21.0000    1.0    0.0           3101266    6.4958      NaN
1290  female  47.0000    1.0    0.0            363272    7.0000      NaN
1294    male  28.5000    0.0    0.0             54636   16.1000      NaN
1295    male  21.0000    0.0    0.0  SOTON/OQ 3101317    7.2500      NaN
1296    male  27.0000    0.0    0.0            315154    8.6625      NaN
1298    male  36.0000    0.0    0.0            345771    9.5000      NaN
1299    male  27.0000    1.0    0.0              2659   14.4542      NaN
1300  female  15.0000    1.0    0.0              2659   14.4542      NaN
1301    male  45.5000    0.0    0.0              2628    7.2250      NaN
1304  female  14.5000    1.0    0.0              2665   14.4542      NaN
1306    male  26.5000    0.0    0.0              2656    7.2250      NaN
1307    male  27.0000    0.0    0.0              2670    7.2250      NaN
1308    male  29.0000    0.0    0.0            315082    7.8750      NaN

     embarked   boat   body                           home.dest
0           S      2    NaN                        St Louis, MO
1           S     11    NaN     Montreal, PQ / Chesterville, ON
2           S    NaN    NaN     Montreal, PQ / Chesterville, ON
3           S    NaN  135.0     Montreal, PQ / Chesterville, ON
4           S    NaN    NaN     Montreal, PQ / Chesterville, ON
5           S      3    NaN                        New York, NY
6           S     10    NaN                          Hudson, NY
7           S    NaN    NaN                         Belfast, NI
8           S      D    NaN                 Bayside, Queens, NY
9           C    NaN   22.0                 Montevideo, Uruguay
10          C    NaN  124.0                        New York, NY
11          C      4    NaN                        New York, NY
12          C      9    NaN                       Paris, France
13          S      6    NaN                                 NaN
14          S      B    NaN                       Hessle, Yorks
16          C    NaN    NaN                        Montreal, PQ
17          C      6    NaN                        Montreal, PQ
18          C      8    NaN                                 NaN
19          C      A    NaN                        Winnipeg, MN
20          S      5    NaN                        New York, NY
21          S      5    NaN                        New York, NY
22          C      5    NaN                        New York, NY
23          C      4    NaN                                 NaN
24          S      8    NaN                                 NaN
25          C    NaN  148.0                   San Francisco, CA
26          C      7    NaN                        Dowagiac, MI
27          C      7    NaN                        Dowagiac, MI
28          S      8    NaN                                 NaN
29          S      D    NaN  Stockholm, Sweden / Washington, DC
30          S    NaN    NaN                         Trenton, NJ
...       ...    ...    ...                                 ...
1269        S    NaN    NaN                                 NaN
1270        S    NaN    NaN                                 NaN
1271        S    NaN    NaN                                 NaN
1272        S    NaN    NaN                                 NaN
1273        S    NaN    NaN                                 NaN
1274        S    NaN    NaN                                 NaN
1275        S    NaN    NaN                                 NaN
1276        S    NaN    NaN                                 NaN
1277        C  13 15    NaN                                 NaN
1278        S    NaN    NaN                                 NaN
1279        S    NaN    NaN                                 NaN
1280        S    NaN    NaN                                 NaN
1281        S    NaN    NaN      Antwerp, Belgium / Stanton, OH
1285        S    NaN  298.0                                 NaN
1286        C      C    NaN                                 NaN
1287        S    NaN    NaN                                 NaN
1288        S    NaN  314.0                                 NaN
1289        S    NaN    NaN                                 NaN
1290        S    NaN    NaN                                 NaN
1294        S    NaN   14.0                                 NaN
1295        S    NaN    NaN                                 NaN
1296        S    NaN  131.0                                 NaN
1298        S    NaN    NaN                                 NaN
1299        C      C    NaN                                 NaN
1300        C    NaN    NaN                                 NaN
1301        C    NaN  312.0                                 NaN
1304        C    NaN  328.0                                 NaN
1306        C    NaN  304.0                                 NaN
1307        C    NaN    NaN                                 NaN
1308        S    NaN    NaN                                 NaN

[1046 rows x 14 columns]

#### <p style="color:Gray">Dataframe.loc()<p/>
These work just like column labels, and can be values like numbers, characters, and strings.

In [22]:
first_five_rows = new_titanic_survival.iloc[0:5]
print(first_five_rows)

   pclass  survived                                             name     sex  \
0     1.0       1.0                    Allen, Miss. Elisabeth Walton  female
1     1.0       1.0                   Allison, Master. Hudson Trevor    male
2     1.0       0.0                     Allison, Miss. Helen Loraine  female
3     1.0       0.0             Allison, Mr. Hudson Joshua Creighton    male
4     1.0       0.0  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  female

       age  sibsp  parch  ticket      fare    cabin embarked boat   body  \
0  29.0000    0.0    0.0   24160  211.3375       B5        S    2    NaN
1   0.9167    1.0    2.0  113781  151.5500  C22 C26        S   11    NaN
2   2.0000    1.0    2.0  113781  151.5500  C22 C26        S  NaN    NaN
3  30.0000    1.0    2.0  113781  151.5500  C22 C26        S  NaN  135.0
4  25.0000    1.0    2.0  113781  151.5500  C22 C26        S  NaN    NaN

                         home.dest
0                     St Louis, MO
1  Montreal, PQ / Chesterville, ON
2  Montreal, PQ / Chesterville, ON
3  Montreal, PQ / Chesterville, ON
4  Montreal, PQ / Chesterville, ON

In [23]:
first_ten_rows = new_titanic_survival.iloc[0:10]
print(first_ten_rows)

   pclass  survived                                             name     sex  \
0     1.0       1.0                    Allen, Miss. Elisabeth Walton  female
1     1.0       1.0                   Allison, Master. Hudson Trevor    male
2     1.0       0.0                     Allison, Miss. Helen Loraine  female
3     1.0       0.0             Allison, Mr. Hudson Joshua Creighton    male
4     1.0       0.0  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  female
5     1.0       1.0                              Anderson, Mr. Harry    male
6     1.0       1.0                Andrews, Miss. Kornelia Theodosia  female
7     1.0       0.0                           Andrews, Mr. Thomas Jr    male
8     1.0       1.0    Appleton, Mrs. Edward Dale (Charlotte Lamson)  female
9     1.0       0.0                          Artagaveytia, Mr. Ramon    male

       age  sibsp  parch    ticket      fare    cabin embarked boat   body  \
0  29.0000    0.0    0.0     24160  211.3375       B5        S    2    NaN
1   0.9167    1.0    2.0    113781  151.5500  C22 C26        S   11    NaN
2   2.0000    1.0    2.0    113781  151.5500  C22 C26        S  NaN    NaN
3  30.0000    1.0    2.0    113781  151.5500  C22 C26        S  NaN  135.0
4  25.0000    1.0    2.0    113781  151.5500  C22 C26        S  NaN    NaN
5  48.0000    0.0    0.0     19952   26.5500      E12        S    3    NaN
6  63.0000    1.0    0.0     13502   77.9583       D7        S   10    NaN
7  39.0000    0.0    0.0    112050    0.0000      A36        S  NaN    NaN
8  53.0000    2.0    0.0     11769   51.4792     C101        S    D    NaN
9  71.0000    0.0    0.0  PC 17609   49.5042      NaN        C  NaN   22.0

                         home.dest
0                     St Louis, MO
1  Montreal, PQ / Chesterville, ON
2  Montreal, PQ / Chesterville, ON
3  Montreal, PQ / Chesterville, ON
4  Montreal, PQ / Chesterville, ON
5                     New York, NY
6                       Hudson, NY
7                      Belfast, NI
8              Bayside, Queens, NY
9              Montevideo, Uruguay

In [24]:
row_position_fifth = new_titanic_survival.iloc[4]
print(row_position_fifth)

pclass                                                     1
survived                                                   0
name         Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
sex                                                   female
age                                                       25
sibsp                                                      1
parch                                                      2
ticket                                                113781
fare                                                  151.55
cabin                                                C22 C26
embarked                                                   S
boat                                                     NaN
body                                                     NaN
home.dest                    Montreal, PQ / Chesterville, ON
Name: 4, dtype: object

Assign the row with index label 25 from new_titanic_survival

In [25]:
row_index_25 = new_titanic_survival.loc[25]

In [26]:
first_row_first_column = new_titanic_survival.iloc[0,0]
print(first_row_first_column)

1.0

In [27]:
all_rows_first_three_columns = new_titanic_survival.iloc[:, 0:3]
print(all_rows_first_three_columns)

      pclass  survived                                               name
0        1.0       1.0                      Allen, Miss. Elisabeth Walton
1        1.0       1.0                     Allison, Master. Hudson Trevor
2        1.0       0.0                       Allison, Miss. Helen Loraine
3        1.0       0.0               Allison, Mr. Hudson Joshua Creighton
4        1.0       0.0    Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
5        1.0       1.0                                Anderson, Mr. Harry
6        1.0       1.0                  Andrews, Miss. Kornelia Theodosia
7        1.0       0.0                             Andrews, Mr. Thomas Jr
8        1.0       1.0      Appleton, Mrs. Edward Dale (Charlotte Lamson)
9        1.0       0.0                            Artagaveytia, Mr. Ramon
10       1.0       0.0                             Astor, Col. John Jacob
11       1.0       1.0  Astor, Mrs. John Jacob (Madeleine Talmadge Force)
12       1.0       1.0                      Aubart, Mme. Leontine Pauline
13       1.0       1.0                       Barber, Miss. Ellen "Nellie"
14       1.0       1.0               Barkworth, Mr. Algernon Henry Wilson
16       1.0       0.0                           Baxter, Mr. Quigg Edmond
17       1.0       1.0    Baxter, Mrs. James (Helene DeLaudeniere Chaput)
18       1.0       1.0                              Bazzani, Miss. Albina
19       1.0       0.0                               Beattie, Mr. Thomson
20       1.0       1.0                      Beckwith, Mr. Richard Leonard
21       1.0       1.0   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)
22       1.0       1.0                              Behr, Mr. Karl Howell
23       1.0       1.0                              Bidois, Miss. Rosalie
24       1.0       1.0                                  Bird, Miss. Ellen
25       1.0       0.0                                Birnbaum, Mr. Jakob
26       1.0       1.0                            Bishop, Mr. Dickinson H
27       1.0       1.0            Bishop, Mrs. Dickinson H (Helen Walton)
28       1.0       1.0                             Bissette, Miss. Amelia
29       1.0       1.0          Bjornstrom-Steffansson, Mr. Mauritz Hakan
30       1.0       0.0                       Blackwell, Mr. Stephen Weart
...      ...       ...                                                ...
1269     3.0       0.0                   Vande Velde, Mr. Johannes Joseph
1270     3.0       0.0                     Vande Walle, Mr. Nestor Cyriel
1271     3.0       0.0                        Vanden Steen, Mr. Leo Peter
1272     3.0       0.0                        Vander Cruyssen, Mr. Victor
1273     3.0       0.0                 Vander Planke, Miss. Augusta Maria
1274     3.0       0.0                          Vander Planke, Mr. Julius
1275     3.0       0.0                    Vander Planke, Mr. Leo Edmondus
1276     3.0       0.0  Vander Planke, Mrs. Julius (Emelia Maria Vande...
1277     3.0       1.0                               Vartanian, Mr. David
1278     3.0       0.0                             Vendel, Mr. Olof Edvin
1279     3.0       0.0               Vestrom, Miss. Hulda Amanda Adolfina
1280     3.0       0.0                                    Vovk, Mr. Janko
1281     3.0       0.0                               Waelens, Mr. Achille
1285     3.0       0.0                                Wenzel, Mr. Linhart
1286     3.0       1.0    Whabee, Mrs. George Joseph (Shawneene Abi-Saab)
1287     3.0       0.0                   Widegren, Mr. Carl/Charles Peter
1288     3.0       0.0                          Wiklund, Mr. Jakob Alfred
1289     3.0       0.0                            Wiklund, Mr. Karl Johan
1290     3.0       1.0                   Wilkes, Mrs. James (Ellen Needs)
1294     3.0       0.0                               Williams, Mr. Leslie
1295     3.0       0.0                                Windelov, Mr. Einar
1296     3.0       0.0                                   Wirz, Mr. Albert
1298     3.0       0.0                          Wittevrongel, Mr. Camille
1299     3.0       0.0                                Yasbeck, Mr. Antoni
1300     3.0       1.0            Yasbeck, Mrs. Antoni (Selini Alexander)
1301     3.0       0.0                               Youseff, Mr. Gerious
1304     3.0       0.0                               Zabour, Miss. Hileni
1306     3.0       0.0                          Zakarian, Mr. Mapriededer
1307     3.0       0.0                                Zakarian, Mr. Ortin
1308     3.0       0.0                                 Zimmerman, Mr. Leo

[1046 rows x 3 columns]

In [28]:
row_index_83_age = new_titanic_survival.loc[83, "age"]
print(row_index_83_age)

64.0

In [29]:
row_83_colums_all = new_titanic_survival.iloc[85, :] #82 , #83, #84
print(row_83_colums_all)

pclass                               1
survived                             1
name         Dodge, Master. Washington
sex                               male
age                                  4
sibsp                                0
parch                                2
ticket                           33638
fare                           81.8583
cabin                              A34
embarked                             S
boat                                 5
body                               NaN
home.dest            San Francisco, CA
Name: 94, dtype: object

In [30]:
row_index_766_pclass = new_titanic_survival.loc[766, "pclass"]
print(row_index_766_pclass)

3.0

In [31]:
row_index_1100_age = new_titanic_survival.loc[1100, "age"]
print(row_index_1100_age)

29.0

In [32]:
row_index_25_survived = new_titanic_survival.loc[25, "survived"]
print(row_index_25_survived)

0.0

In [33]:
five_rows_three_cols = new_titanic_survival.iloc[0:5, 0:3]
print(five_rows_three_cols)

   pclass  survived                                             name
0     1.0       1.0                    Allen, Miss. Elisabeth Walton
1     1.0       1.0                   Allison, Master. Hudson Trevor
2     1.0       0.0                     Allison, Miss. Helen Loraine
3     1.0       0.0             Allison, Mr. Hudson Joshua Creighton
4     1.0       0.0  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)

#### <p style="color:Gray">Dataframe.reset_index()<p/>
나이별로 정렬한 것은 인덱스가 더 이상 순차적이지 않다. 
각 행들은 titanic_survival에서 존재한 원래 색인을 유지했기 때문. 
따라서 0부터 시작하여 다시 인덱싱할 필요가 있다. <br>
<br>
기본적으로 메서드는 이전 인덱스 값을 사용하여 데이터 프레임에 추가 열을 추가하여 이전 인덱스를 유지합니다.

In [34]:
titanic_reindexed = new_titanic_survival.reset_index(drop=True)

In [35]:
print(titanic_reindexed.iloc[0:5, 0:3])

   pclass  survived                                             name
0     1.0       1.0                    Allen, Miss. Elisabeth Walton
1     1.0       1.0                   Allison, Master. Hudson Trevor
2     1.0       0.0                     Allison, Miss. Helen Loraine
3     1.0       0.0             Allison, Mr. Hudson Joshua Creighton
4     1.0       0.0  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)

뻘짓!
How can I write a function that counts the number of null elements in a Series.

In [36]:
def hundredth_row(column):
    hundredth_item = column.iloc[99]
    return hundredth_item

In [37]:
hundredth_row_var = titanic_survival.apply(hundredth_row)
print(hundredth_row_var)

pclass                                                       1
survived                                                     1
name         Duff Gordon, Lady. (Lucille Christiana Sutherl...
sex                                                     female
age                                                         48
sibsp                                                        1
parch                                                        0
ticket                                                   11755
fare                                                      39.6
cabin                                                      A16
embarked                                                     C
boat                                                         1
body                                                       NaN
home.dest                                       London / Paris
dtype: object

In [38]:
def find_null(value):
    if value is None:
        return "null values"
    elif value is not None:
        return "no nulls here"

In [39]:
print(find_null(titanic_reindexed))

no nulls here

In [40]:
null_count = 0
value_count = 0
for value in titanic_reindexed:
    if value is None:
        null_count += 1
    elif value is not None:
        value_count += 1

In [41]:
print(null_count)
print(value_count)

0
14

In [42]:
print(titanic_reindexed)

      pclass  survived                                               name  \
0        1.0       1.0                      Allen, Miss. Elisabeth Walton
1        1.0       1.0                     Allison, Master. Hudson Trevor
2        1.0       0.0                       Allison, Miss. Helen Loraine
3        1.0       0.0               Allison, Mr. Hudson Joshua Creighton
4        1.0       0.0    Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
5        1.0       1.0                                Anderson, Mr. Harry
6        1.0       1.0                  Andrews, Miss. Kornelia Theodosia
7        1.0       0.0                             Andrews, Mr. Thomas Jr
8        1.0       1.0      Appleton, Mrs. Edward Dale (Charlotte Lamson)
9        1.0       0.0                            Artagaveytia, Mr. Ramon
10       1.0       0.0                             Astor, Col. John Jacob
11       1.0       1.0  Astor, Mrs. John Jacob (Madeleine Talmadge Force)
12       1.0       1.0                      Aubart, Mme. Leontine Pauline
13       1.0       1.0                       Barber, Miss. Ellen "Nellie"
14       1.0       1.0               Barkworth, Mr. Algernon Henry Wilson
15       1.0       0.0                           Baxter, Mr. Quigg Edmond
16       1.0       1.0    Baxter, Mrs. James (Helene DeLaudeniere Chaput)
17       1.0       1.0                              Bazzani, Miss. Albina
18       1.0       0.0                               Beattie, Mr. Thomson
19       1.0       1.0                      Beckwith, Mr. Richard Leonard
20       1.0       1.0   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)
21       1.0       1.0                              Behr, Mr. Karl Howell
22       1.0       1.0                              Bidois, Miss. Rosalie
23       1.0       1.0                                  Bird, Miss. Ellen
24       1.0       0.0                                Birnbaum, Mr. Jakob
25       1.0       1.0                            Bishop, Mr. Dickinson H
26       1.0       1.0            Bishop, Mrs. Dickinson H (Helen Walton)
27       1.0       1.0                             Bissette, Miss. Amelia
28       1.0       1.0          Bjornstrom-Steffansson, Mr. Mauritz Hakan
29       1.0       0.0                       Blackwell, Mr. Stephen Weart
...      ...       ...                                                ...
1016     3.0       0.0                   Vande Velde, Mr. Johannes Joseph
1017     3.0       0.0                     Vande Walle, Mr. Nestor Cyriel
1018     3.0       0.0                        Vanden Steen, Mr. Leo Peter
1019     3.0       0.0                        Vander Cruyssen, Mr. Victor
1020     3.0       0.0                 Vander Planke, Miss. Augusta Maria
1021     3.0       0.0                          Vander Planke, Mr. Julius
1022     3.0       0.0                    Vander Planke, Mr. Leo Edmondus
1023     3.0       0.0  Vander Planke, Mrs. Julius (Emelia Maria Vande...
1024     3.0       1.0                               Vartanian, Mr. David
1025     3.0       0.0                             Vendel, Mr. Olof Edvin
1026     3.0       0.0               Vestrom, Miss. Hulda Amanda Adolfina
1027     3.0       0.0                                    Vovk, Mr. Janko
1028     3.0       0.0                               Waelens, Mr. Achille
1029     3.0       0.0                                Wenzel, Mr. Linhart
1030     3.0       1.0    Whabee, Mrs. George Joseph (Shawneene Abi-Saab)
1031     3.0       0.0                   Widegren, Mr. Carl/Charles Peter
1032     3.0       0.0                          Wiklund, Mr. Jakob Alfred
1033     3.0       0.0                            Wiklund, Mr. Karl Johan
1034     3.0       1.0                   Wilkes, Mrs. James (Ellen Needs)
1035     3.0       0.0                               Williams, Mr. Leslie
1036     3.0       0.0                                Windelov, Mr. Einar
1037     3.0       0.0                                   Wirz, Mr. Albert
1038     3.0       0.0                          Wittevrongel, Mr. Camille
1039     3.0       0.0                                Yasbeck, Mr. Antoni
1040     3.0       1.0            Yasbeck, Mrs. Antoni (Selini Alexander)
1041     3.0       0.0                               Youseff, Mr. Gerious
1042     3.0       0.0                               Zabour, Miss. Hileni
1043     3.0       0.0                          Zakarian, Mr. Mapriededer
1044     3.0       0.0                                Zakarian, Mr. Ortin
1045     3.0       0.0                                 Zimmerman, Mr. Leo

         sex      age  sibsp  parch            ticket      fare    cabin  \
0     female  29.0000    0.0    0.0             24160  211.3375       B5
1       male   0.9167    1.0    2.0            113781  151.5500  C22 C26
2     female   2.0000    1.0    2.0            113781  151.5500  C22 C26
3       male  30.0000    1.0    2.0            113781  151.5500  C22 C26
4     female  25.0000    1.0    2.0            113781  151.5500  C22 C26
5       male  48.0000    0.0    0.0             19952   26.5500      E12
6     female  63.0000    1.0    0.0             13502   77.9583       D7
7       male  39.0000    0.0    0.0            112050    0.0000      A36
8     female  53.0000    2.0    0.0             11769   51.4792     C101
9       male  71.0000    0.0    0.0          PC 17609   49.5042      NaN
10      male  47.0000    1.0    0.0          PC 17757  227.5250  C62 C64
11    female  18.0000    1.0    0.0          PC 17757  227.5250  C62 C64
12    female  24.0000    0.0    0.0          PC 17477   69.3000      B35
13    female  26.0000    0.0    0.0             19877   78.8500      NaN
14      male  80.0000    0.0    0.0             27042   30.0000      A23
15      male  24.0000    0.0    1.0          PC 17558  247.5208  B58 B60
16    female  50.0000    0.0    1.0          PC 17558  247.5208  B58 B60
17    female  32.0000    0.0    0.0             11813   76.2917      D15
18      male  36.0000    0.0    0.0             13050   75.2417       C6
19      male  37.0000    1.0    1.0             11751   52.5542      D35
20    female  47.0000    1.0    1.0             11751   52.5542      D35
21      male  26.0000    0.0    0.0            111369   30.0000     C148
22    female  42.0000    0.0    0.0          PC 17757  227.5250      NaN
23    female  29.0000    0.0    0.0          PC 17483  221.7792      C97
24      male  25.0000    0.0    0.0             13905   26.0000      NaN
25      male  25.0000    1.0    0.0             11967   91.0792      B49
26    female  19.0000    1.0    0.0             11967   91.0792      B49
27    female  35.0000    0.0    0.0          PC 17760  135.6333      C99
28      male  28.0000    0.0    0.0            110564   26.5500      C52
29      male  45.0000    0.0    0.0            113784   35.5000        T
...      ...      ...    ...    ...               ...       ...      ...
1016    male  33.0000    0.0    0.0            345780    9.5000      NaN
1017    male  28.0000    0.0    0.0            345770    9.5000      NaN
1018    male  28.0000    0.0    0.0            345783    9.5000      NaN
1019    male  47.0000    0.0    0.0            345765    9.0000      NaN
1020  female  18.0000    2.0    0.0            345764   18.0000      NaN
1021    male  31.0000    3.0    0.0            345763   18.0000      NaN
1022    male  16.0000    2.0    0.0            345764   18.0000      NaN
1023  female  31.0000    1.0    0.0            345763   18.0000      NaN
1024    male  22.0000    0.0    0.0              2658    7.2250      NaN
1025    male  20.0000    0.0    0.0            350416    7.8542      NaN
1026  female  14.0000    0.0    0.0            350406    7.8542      NaN
1027    male  22.0000    0.0    0.0            349252    7.8958      NaN
1028    male  22.0000    0.0    0.0            345767    9.0000      NaN
1029    male  32.5000    0.0    0.0            345775    9.5000      NaN
1030  female  38.0000    0.0    0.0              2688    7.2292      NaN
1031    male  51.0000    0.0    0.0            347064    7.7500      NaN
1032    male  18.0000    1.0    0.0           3101267    6.4958      NaN
1033    male  21.0000    1.0    0.0           3101266    6.4958      NaN
1034  female  47.0000    1.0    0.0            363272    7.0000      NaN
1035    male  28.5000    0.0    0.0             54636   16.1000      NaN
1036    male  21.0000    0.0    0.0  SOTON/OQ 3101317    7.2500      NaN
1037    male  27.0000    0.0    0.0            315154    8.6625      NaN
1038    male  36.0000    0.0    0.0            345771    9.5000      NaN
1039    male  27.0000    1.0    0.0              2659   14.4542      NaN
1040  female  15.0000    1.0    0.0              2659   14.4542      NaN
1041    male  45.5000    0.0    0.0              2628    7.2250      NaN
1042  female  14.5000    1.0    0.0              2665   14.4542      NaN
1043    male  26.5000    0.0    0.0              2656    7.2250      NaN
1044    male  27.0000    0.0    0.0              2670    7.2250      NaN
1045    male  29.0000    0.0    0.0            315082    7.8750      NaN

     embarked   boat   body                           home.dest
0           S      2    NaN                        St Louis, MO
1           S     11    NaN     Montreal, PQ / Chesterville, ON
2           S    NaN    NaN     Montreal, PQ / Chesterville, ON
3           S    NaN  135.0     Montreal, PQ / Chesterville, ON
4           S    NaN    NaN     Montreal, PQ / Chesterville, ON
5           S      3    NaN                        New York, NY
6           S     10    NaN                          Hudson, NY
7           S    NaN    NaN                         Belfast, NI
8           S      D    NaN                 Bayside, Queens, NY
9           C    NaN   22.0                 Montevideo, Uruguay
10          C    NaN  124.0                        New York, NY
11          C      4    NaN                        New York, NY
12          C      9    NaN                       Paris, France
13          S      6    NaN                                 NaN
14          S      B    NaN                       Hessle, Yorks
15          C    NaN    NaN                        Montreal, PQ
16          C      6    NaN                        Montreal, PQ
17          C      8    NaN                                 NaN
18          C      A    NaN                        Winnipeg, MN
19          S      5    NaN                        New York, NY
20          S      5    NaN                        New York, NY
21          C      5    NaN                        New York, NY
22          C      4    NaN                                 NaN
23          S      8    NaN                                 NaN
24          C    NaN  148.0                   San Francisco, CA
25          C      7    NaN                        Dowagiac, MI
26          C      7    NaN                        Dowagiac, MI
27          S      8    NaN                                 NaN
28          S      D    NaN  Stockholm, Sweden / Washington, DC
29          S    NaN    NaN                         Trenton, NJ
...       ...    ...    ...                                 ...
1016        S    NaN    NaN                                 NaN
1017        S    NaN    NaN                                 NaN
1018        S    NaN    NaN                                 NaN
1019        S    NaN    NaN                                 NaN
1020        S    NaN    NaN                                 NaN
1021        S    NaN    NaN                                 NaN
1022        S    NaN    NaN                                 NaN
1023        S    NaN    NaN                                 NaN
1024        C  13 15    NaN                                 NaN
1025        S    NaN    NaN                                 NaN
1026        S    NaN    NaN                                 NaN
1027        S    NaN    NaN                                 NaN
1028        S    NaN    NaN      Antwerp, Belgium / Stanton, OH
1029        S    NaN  298.0                                 NaN
1030        C      C    NaN                                 NaN
1031        S    NaN    NaN                                 NaN
1032        S    NaN  314.0                                 NaN
1033        S    NaN    NaN                                 NaN
1034        S    NaN    NaN                                 NaN
1035        S    NaN   14.0                                 NaN
1036        S    NaN    NaN                                 NaN
1037        S    NaN  131.0                                 NaN
1038        S    NaN    NaN                                 NaN
1039        C      C    NaN                                 NaN
1040        C    NaN    NaN                                 NaN
1041        C    NaN  312.0                                 NaN
1042        C    NaN  328.0                                 NaN
1043        C    NaN  304.0                                 NaN
1044        C    NaN    NaN                                 NaN
1045        S    NaN    NaN                                 NaN

[1046 rows x 14 columns]

### <p style="color:orange">cheating</p>

In [43]:
def null_count(column):
    column_null = pd.isnull(column)
    null = column[column_null]
    return len(null)

In [44]:
column_null_count = titanic_survival.apply(null_count)
print(column_null_count)

pclass          1
survived        1
name            1
sex             1
age           264
sibsp           1
parch           1
ticket          1
fare            2
cabin        1015
embarked        3
boat          824
body         1189
home.dest     565
dtype: int64

### <p style="color:green">study self</p>
### <p style="color:green">try1</p>

In [45]:
print(titanic_survival.loc[:, "age"])

0       29.0000
1        0.9167
2        2.0000
3       30.0000
4       25.0000
5       48.0000
6       63.0000
7       39.0000
8       53.0000
9       71.0000
10      47.0000
11      18.0000
12      24.0000
13      26.0000
14      80.0000
15          NaN
16      24.0000
17      50.0000
18      32.0000
19      36.0000
20      37.0000
21      47.0000
22      26.0000
23      42.0000
24      29.0000
25      25.0000
26      25.0000
27      19.0000
28      35.0000
29      28.0000
         ...
1280    22.0000
1281    22.0000
1282        NaN
1283        NaN
1284        NaN
1285    32.5000
1286    38.0000
1287    51.0000
1288    18.0000
1289    21.0000
1290    47.0000
1291        NaN
1292        NaN
1293        NaN
1294    28.5000
1295    21.0000
1296    27.0000
1297        NaN
1298    36.0000
1299    27.0000
1300    15.0000
1301    45.5000
1302        NaN
1303        NaN
1304    14.5000
1305        NaN
1306    26.5000
1307    27.0000
1308    29.0000
1309        NaN
Name: age, Length: 1310, dtype: float64

In [46]:
null_count = 0
for value in titanic_survival.loc[:, "age"]:
    value_null = pd.isnull(value)
#     print(value_null)
#     print(value[value_null])
#     print(len(value[value_null]))
    null_count += len(value[value_null])
print(null_count)

264

pd.isnull에 true, false를 반환한다.<br>
is.null이 null값에 활용되는 것은 알겠는데 아직 잘 모르겠다. 
1. null값 찾기
2. null값이 포함된 row가 몇 개인지 찾기
3. null값이 포함된 column 그리고 column별로 null값이 몇 개인지 알아내기

def 그대로 따라해보면
1. column별로 null값 확인 (true/false)
2. null값인 것들만 저장
3. 그리고 길이 확인

### <p style="color:green">try2</p>

In [47]:
null = []
for value in titanic_survival.loc[:, "age"]:
    value_null = pd.isnull(value)
    null.append(value[value_null])
#     print(null)
len(null)

1310

### <p style = "color:green">try3</p>

In [48]:
age_titanic_survival = titanic_survival.loc[:, "age"]

In [49]:
# print(pd.isnull(age_titanic_survival))
age_null = pd.isnull(age_titanic_survival)

In [50]:
# print(age_null)
print(titanic_survival[age_null])

      pclass  survived                                               name  \
15       1.0       0.0                                Baumann, Mr. John D
37       1.0       1.0      Bradley, Mr. George ("George Arthur Brayton")
40       1.0       0.0                          Brewe, Dr. Arthur Jackson
46       1.0       0.0                              Cairns, Mr. Alexander
59       1.0       1.0  Cassebeer, Mrs. Henry Arthur Jr (Eleanor Genev...
69       1.0       1.0             Chibnall, Mrs. (Edith Martha Bowerman)
70       1.0       0.0              Chisholm, Mr. Roderick Robert Crispin
74       1.0       0.0                        Clifford, Mr. George Quincy
80       1.0       0.0                          Crafton, Mr. John Bertram
106      1.0       0.0                                 Farthing, Mr. John
107      1.0       1.0               Flegenheim, Mrs. Alfred (Antoinette)
108      1.0       1.0                            Fleming, Miss. Margaret
118      1.0       0.0                        Franklin, Mr. Thomas Parham
121      1.0       1.0  Frauenthal, Mrs. Henry William (Clara Heinshei...
125      1.0       0.0                                   Fry, Mr. Richard
134      1.0       1.0       Goldenberg, Mrs. Samuel L (Edwiga Grabowska)
147      1.0       0.0                          Harrington, Mr. Charles H
152      1.0       1.0                        Hawksford, Mr. Walter James
157      1.0       0.0                        Hilliard, Mr. Herbert Henry
166      1.0       0.0                           Hoyt, Mr. William Fisher
176      1.0       1.0                  Kenyon, Mrs. Frederick R (Marion)
179      1.0       0.0                                 Klaber, Mr. Herman
184      1.0       0.0                                  Lewy, Mr. Ervin G
196      1.0       1.0                               Marechal, Mr. Pierre
204      1.0       1.0              Meyer, Mrs. Edgar Joseph (Leila Saks)
219      1.0       1.0                          Omont, Mr. Alfred Fernand
223      1.0       0.0                      Parr, Mr. William Henry Marsh
235      1.0       1.0                Rheims, Mr. George Alexander Lucien
237      1.0       0.0                                Robbins, Mr. Victor
241      1.0       0.0                              Rood, Mr. Hugh Roscoe
...      ...       ...                                                ...
1212     3.0       0.0                               Slabenoff, Mr. Petco
1213     3.0       0.0                      Slocovski, Mr. Selman Francis
1214     3.0       0.0                                Smiljanic, Mr. Mile
1215     3.0       0.0                                  Smith, Mr. Thomas
1216     3.0       1.0                                 Smyth, Miss. Julia
1219     3.0       0.0                                 Spector, Mr. Woolf
1221     3.0       0.0                                  Staneff, Mr. Ivan
1241     3.0       0.0                              Thomas, Mr. Charles P
1242     3.0       0.0                                   Thomas, Mr. John
1243     3.0       0.0                                Thomas, Mr. Tannous
1245     3.0       0.0                    Thomson, Mr. Alexander Morrison
1246     3.0       0.0                         Thorneycroft, Mr. Percival
1247     3.0       1.0  Thorneycroft, Mrs. Percival (Florence Kate White)
1249     3.0       0.0                                   Tobin, Mr. Roger
1250     3.0       0.0                                Todoroff, Mr. Lalio
1253     3.0       0.0                                   Torfa, Mr. Assad
1255     3.0       0.0                                  Toufik, Mr. Nakli
1262     3.0       0.0                van Billiard, Master. James William
1268     3.0       0.0                        van Melkebeke, Mr. Philemon
1282     3.0       0.0                                Ware, Mr. Frederick
1283     3.0       0.0                        Warren, Mr. Charles William
1284     3.0       0.0                                  Webber, Mr. James
1291     3.0       0.0                   Willer, Mr. Aaron ("Abi Weller")
1292     3.0       0.0                                 Willey, Mr. Edward
1293     3.0       0.0                  Williams, Mr. Howard Hugh "Harry"
1297     3.0       0.0                             Wiseman, Mr. Phillippe
1302     3.0       0.0                                  Yousif, Mr. Wazli
1303     3.0       0.0                              Yousseff, Mr. Gerious
1305     3.0       0.0                              Zabour, Miss. Thamine
1309     NaN       NaN                                                NaN

         sex  age  sibsp  parch            ticket      fare cabin embarked  \
15      male  NaN    0.0    0.0          PC 17318   25.9250   NaN        S
37      male  NaN    0.0    0.0            111427   26.5500   NaN        S
40      male  NaN    0.0    0.0            112379   39.6000   NaN        C
46      male  NaN    0.0    0.0            113798   31.0000   NaN        S
59    female  NaN    0.0    0.0             17770   27.7208   NaN        C
69    female  NaN    0.0    1.0            113505   55.0000   E33        S
70      male  NaN    0.0    0.0            112051    0.0000   NaN        S
74      male  NaN    0.0    0.0            110465   52.0000   A14        S
80      male  NaN    0.0    0.0            113791   26.5500   NaN        S
106     male  NaN    0.0    0.0          PC 17483  221.7792   C95        S
107   female  NaN    0.0    0.0          PC 17598   31.6833   NaN        S
108   female  NaN    0.0    0.0             17421  110.8833   NaN        C
118     male  NaN    0.0    0.0            113778   26.5500   D34        S
121   female  NaN    1.0    0.0          PC 17611  133.6500   NaN        S
125     male  NaN    0.0    0.0            112058    0.0000  B102        S
134   female  NaN    1.0    0.0             17453   89.1042   C92        C
147     male  NaN    0.0    0.0            113796   42.4000   NaN        S
152     male  NaN    0.0    0.0             16988   30.0000   D45        S
157     male  NaN    0.0    0.0             17463   51.8625   E46        S
166     male  NaN    0.0    0.0          PC 17600   30.6958   NaN        C
176   female  NaN    1.0    0.0             17464   51.8625   D21        S
179     male  NaN    0.0    0.0            113028   26.5500  C124        S
184     male  NaN    0.0    0.0          PC 17612   27.7208   NaN        C
196     male  NaN    0.0    0.0             11774   29.7000   C47        C
204   female  NaN    1.0    0.0          PC 17604   82.1708   NaN        C
219     male  NaN    0.0    0.0        F.C. 12998   25.7417   NaN        C
223     male  NaN    0.0    0.0            112052    0.0000   NaN        S
235     male  NaN    0.0    0.0          PC 17607   39.6000   NaN        S
237     male  NaN    0.0    0.0          PC 17757  227.5250   NaN        C
241     male  NaN    0.0    0.0            113767   50.0000   A32        S
...      ...  ...    ...    ...               ...       ...   ...      ...
1212    male  NaN    0.0    0.0            349214    7.8958   NaN        S
1213    male  NaN    0.0    0.0   SOTON/OQ 392086    8.0500   NaN        S
1214    male  NaN    0.0    0.0            315037    8.6625   NaN        S
1215    male  NaN    0.0    0.0            384461    7.7500   NaN        Q
1216  female  NaN    0.0    0.0            335432    7.7333   NaN        Q
1219    male  NaN    0.0    0.0         A.5. 3236    8.0500   NaN        S
1221    male  NaN    0.0    0.0            349208    7.8958   NaN        S
1241    male  NaN    1.0    0.0              2621    6.4375   NaN        C
1242    male  NaN    0.0    0.0              2681    6.4375   NaN        C
1243    male  NaN    0.0    0.0              2684    7.2250   NaN        C
1245    male  NaN    0.0    0.0             32302    8.0500   NaN        S
1246    male  NaN    1.0    0.0            376564   16.1000   NaN        S
1247  female  NaN    1.0    0.0            376564   16.1000   NaN        S
1249    male  NaN    0.0    0.0            383121    7.7500   F38        Q
1250    male  NaN    0.0    0.0            349216    7.8958   NaN        S
1253    male  NaN    0.0    0.0              2673    7.2292   NaN        C
1255    male  NaN    0.0    0.0              2641    7.2292   NaN        C
1262    male  NaN    1.0    1.0          A/5. 851   14.5000   NaN        S
1268    male  NaN    0.0    0.0            345777    9.5000   NaN        S
1282    male  NaN    0.0    0.0            359309    8.0500   NaN        S
1283    male  NaN    0.0    0.0        C.A. 49867    7.5500   NaN        S
1284    male  NaN    0.0    0.0  SOTON/OQ 3101316    8.0500   NaN        S
1291    male  NaN    0.0    0.0              3410    8.7125   NaN        S
1292    male  NaN    0.0    0.0     S.O./P.P. 751    7.5500   NaN        S
1293    male  NaN    0.0    0.0          A/5 2466    8.0500   NaN        S
1297    male  NaN    0.0    0.0        A/4. 34244    7.2500   NaN        S
1302    male  NaN    0.0    0.0              2647    7.2250   NaN        C
1303    male  NaN    0.0    0.0              2627   14.4583   NaN        C
1305  female  NaN    1.0    0.0              2665   14.4542   NaN        C
1309     NaN  NaN    NaN    NaN               NaN       NaN   NaN      NaN

     boat  body                         home.dest
15    NaN   NaN                      New York, NY
37      9   NaN                   Los Angeles, CA
40    NaN   NaN                  Philadelphia, PA
46    NaN   NaN                               NaN
59      5   NaN                      New York, NY
69      6   NaN  St Leonards-on-Sea, England Ohio
70    NaN   NaN      Liverpool, England / Belfast
74    NaN   NaN                     Stoughton, MA
80    NaN   NaN                     Roachdale, IN
106   NaN   NaN                               NaN
107     7   NaN                      New York, NY
108     4   NaN                               NaN
118   NaN   NaN           Westcliff-on-Sea, Essex
121     5   NaN                      New York, NY
125   NaN   NaN                               NaN
134     5   NaN      Paris, France / New York, NY
147   NaN   NaN                               NaN
152     3   NaN                  Kingston, Surrey
157   NaN   NaN                      Brighton, MA
166    14   NaN                      New York, NY
176     8   NaN           Southington / Noank, CT
179   NaN   NaN                      Portland, OR
184   NaN   NaN                       Chicago, IL
196     7   NaN                     Paris, France
204     6   NaN                      New York, NY
219     7   NaN                     Paris, France
223   NaN   NaN                           Belfast
235     A   NaN             Paris /  New York, NY
237   NaN   NaN                               NaN
241   NaN   NaN                       Seattle, WA
...   ...   ...                               ...
1212  NaN   NaN                               NaN
1213  NaN   NaN                               NaN
1214  NaN   NaN                               NaN
1215  NaN   NaN                               NaN
1216   13   NaN                               NaN
1219  NaN   NaN                               NaN
1221  NaN   NaN                               NaN
1241  NaN   NaN                               NaN
1242  NaN   NaN                               NaN
1243  NaN   NaN                               NaN
1245  NaN   NaN                               NaN
1246  NaN   NaN                               NaN
1247   10   NaN                               NaN
1249  NaN   NaN                               NaN
1250  NaN   NaN                               NaN
1253  NaN   NaN                               NaN
1255  NaN   NaN                               NaN
1262  NaN   NaN                               NaN
1268  NaN   NaN                               NaN
1282  NaN   NaN                               NaN
1283  NaN   NaN                               NaN
1284  NaN   NaN                               NaN
1291  NaN   NaN                               NaN
1292  NaN   NaN                               NaN
1293  NaN   NaN                               NaN
1297  NaN   NaN                               NaN
1302  NaN   NaN                               NaN
1303  NaN   NaN                               NaN
1305  NaN   NaN                               NaN
1309  NaN   NaN                               NaN

[264 rows x 14 columns]

In [51]:
print(len(titanic_survival[age_null]))

264

In [52]:
fare_titanic_survival = titanic_survival.loc[:, 'fare']

In [53]:
fare_null = pd.isnull(fare_titanic_survival)
# print(fare_null) # true, false만을 반환

0       False
1       False
2       False
3       False
4       False
5       False
6       False
7       False
8       False
9       False
10      False
11      False
12      False
13      False
14      False
15      False
16      False
17      False
18      False
19      False
20      False
21      False
22      False
23      False
24      False
25      False
26      False
27      False
28      False
29      False
        ...
1280    False
1281    False
1282    False
1283    False
1284    False
1285    False
1286    False
1287    False
1288    False
1289    False
1290    False
1291    False
1292    False
1293    False
1294    False
1295    False
1296    False
1297    False
1298    False
1299    False
1300    False
1301    False
1302    False
1303    False
1304    False
1305    False
1306    False
1307    False
1308    False
1309     True
Name: fare, Length: 1310, dtype: bool

In [55]:
print(titanic_survival[fare_null]) #1225와 1309에 fare null값이 있다. 따라서, 
print(len(titanic_survival[fare_null]))

      pclass  survived                name   sex   age  sibsp  parch ticket  \
1225     3.0       0.0  Storey, Mr. Thomas  male  60.5    0.0    0.0   3701
1309     NaN       NaN                 NaN   NaN   NaN    NaN    NaN    NaN

      fare cabin embarked boat   body home.dest
1225   NaN   NaN        S  NaN  261.0       NaN
1309   NaN   NaN      NaN  NaN    NaN       NaN
2

### 100번째에 있는 값을 확인하려면

In [56]:
def hundredth_row(column):
    hundredth_item = column.iloc[99]
    return hundredth_item

In [57]:
hundredth_row_var = titanic_survival.apply(hundredth_row)
print(hundredth_row_var)

pclass                                                       1
survived                                                     1
name         Duff Gordon, Lady. (Lucille Christiana Sutherl...
sex                                                     female
age                                                         48
sibsp                                                        1
parch                                                        0
ticket                                                   11755
fare                                                      39.6
cabin                                                      A16
embarked                                                     C
boat                                                         1
body                                                       NaN
home.dest                                       London / Paris
dtype: object

<p>By passing in the axis=1 arhument, we can use the DataFrame.apply() method to iterate over rows instead of columns</p>
<p>We can user this to calculate some summary information about the ages of the passengers on the Titanic.</p>

### <p style="color:red">if/elif/else</p>

In [61]:
def which_class(row):
    pclass = row['pclass']
    if pd.isnull(pclass):
        return "Unknown"
    elif pclass == 1:
        return "First"
    elif pclass == 2:
        return "Second"
    else:
        return "Third"
classes = titanic_survival.apply(which_class, axis=1)
print(classes)

0         First
1         First
2         First
3         First
4         First
5         First
6         First
7         First
8         First
9         First
10        First
11        First
12        First
13        First
14        First
15        First
16        First
17        First
18        First
19        First
20        First
21        First
22        First
23        First
24        First
25        First
26        First
27        First
28        First
29        First
         ...
1280      Third
1281      Third
1282      Third
1283      Third
1284      Third
1285      Third
1286      Third
1287      Third
1288      Third
1289      Third
1290      Third
1291      Third
1292      Third
1293      Third
1294      Third
1295      Third
1296      Third
1297      Third
1298      Third
1299      Third
1300      Third
1301      Third
1302      Third
1303      Third
1304      Third
1305      Third
1306      Third
1307      Third
1308      Third
1309    Unknown
Length: 1310, dtype: object

<p style="color:green"> Create a function that returns the string "minor" if someone is under 18, "adult" if they are equal to or over 18, and "unknown" if their age is null </p>

In [64]:
def is_minor(row):
    if row["age"] < 18:
        return "minor"
    else:
        return "adult"
    
minors = titanic_survival.apply(is_minor, axis=1)
print(minors)

0       adult
1       minor
2       minor
3       adult
4       adult
5       adult
6       adult
7       adult
8       adult
9       adult
10      adult
11      adult
12      adult
13      adult
14      adult
15      adult
16      adult
17      adult
18      adult
19      adult
20      adult
21      adult
22      adult
23      adult
24      adult
25      adult
26      adult
27      adult
28      adult
29      adult
        ...
1280    adult
1281    adult
1282    adult
1283    adult
1284    adult
1285    adult
1286    adult
1287    adult
1288    adult
1289    adult
1290    adult
1291    adult
1292    adult
1293    adult
1294    adult
1295    adult
1296    adult
1297    adult
1298    adult
1299    adult
1300    minor
1301    adult
1302    adult
1303    adult
1304    minor
1305    adult
1306    adult
1307    adult
1308    adult
1309    adult
Length: 1310, dtype: object

In [77]:
def classify_age(row):
    age = row["age"]
    if pd.isnull(age):
        return "nuknown"
    elif age < 18:
        return "minor"
    else:
        return "adult"
# print(titanic_survival.apply(classify_age, axis=1))
age_labels = titanic_survival.apply(classify_age, axis=1)
print(age_labels)
# print(age_labels[adult]) no excute

0         adult
1         minor
2         minor
3         adult
4         adult
5         adult
6         adult
7         adult
8         adult
9         adult
10        adult
11        adult
12        adult
13        adult
14        adult
15      nuknown
16        adult
17        adult
18        adult
19        adult
20        adult
21        adult
22        adult
23        adult
24        adult
25        adult
26        adult
27        adult
28        adult
29        adult
         ...
1280      adult
1281      adult
1282    nuknown
1283    nuknown
1284    nuknown
1285      adult
1286      adult
1287      adult
1288      adult
1289      adult
1290      adult
1291    nuknown
1292    nuknown
1293    nuknown
1294      adult
1295      adult
1296      adult
1297    nuknown
1298      adult
1299      adult
1300      minor
1301      adult
1302    nuknown
1303    nuknown
1304      minor
1305    nuknown
1306      adult
1307      adult
1308      adult
1309    nuknown
Length: 1310, dtype: object

<p style="color:green">Let's make a pivot table to find the probability of survival for each age group.</p>

<p style="color:red">I don't know why I can't do this</p>

In [79]:
# age_group_survival = titanic_survival.pivot_table(index="age_labels", values="survived")
# print(age_group_survival)

KeyError: 'age_labels'